name: "whisper"
backend: "python"
max_batch_size: 0

input [
  {
    name: "audio_data"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]   # [batch=1, variable num_samples]
  },
  {
    name: "sample_rate"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

output [
  {
    name: "transcript"
    data_type: TYPE_BYTES
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
